read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32_div.v
read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32_alu.v
read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32_csr.v
read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32_alumuldiv.v
read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32_flow_ctrl.v
read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32_prefetch.v
read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32_regfile.v
read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32_decoder.v
read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32_urom.v
read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32.v
read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/cores/nanorv32_pil.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/tap_top.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/adbg_wb_biu.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/adbg_jsp_biu.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/adbg_or1k_status_reg.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/adbg_top.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/adbg_or1k_module.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/syncflop.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/adbg_jsp_module.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/bytefifo.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/adbg_crc32.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/syncreg.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/adbg_or1k_biu.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/adbg_wb_module.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../wisbone_2_ahb/src/ahbmas_wbslv_top.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/bytewrite_ram_32bits.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/cmsdk_ahb_ram.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/ahb_to_ssram.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/HastiBus.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/HastiSlaveMux.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/HastiXbar.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/Ahbmli.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/Apbbridge.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/gpio_apb.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/imported_from_ultraembedded/uart.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/imported_from_ultraembedded/uart_periph.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/imported_from_ultraembedded/intr_periph.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/imported_from_ultraembedded/timer_periph.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/uart_wrapper.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/timer_wrapper.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/nanorv32_intc.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/chips/nanorv32_irq_mapper.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/chips/nanorv32_clkgen.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/chips/port_mux.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/ips/std_pad.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/chips/top_io.v
#read_verilog  -DSYNT -DNO_RAM_INIT  -I../../adv_debug_sys/Hardware/jtag/tap/rtl/verilog/ -I../../adv_debug_sys/Hardware/adv_dbg_if/rtl/verilog/ -I../../rtl/cores/ -I../../rtl/chips/ -I../../sim/verilog/ -I../../rtl/imported_from_ultraembedded  ../../rtl/chips/nanorv32_simpleahb.v


# As recommended by the yosys readme on github
# the high-level stuff
hierarchy; proc; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

dfflibmap -liberty ../../osu_soc/cadence/lib/tsmc018/signalstorm/osu018_stdcells.lib
abc  -liberty ../../osu_soc/cadence/lib/tsmc018/signalstorm/osu018_stdcells.lib

write_verilog chip.synt.v
